-- MySQL dump 10.13  Distrib 5.7.9, for osx10.9 (x86_64)
--
-- Host: localhost    Database: jabong
-- ------------------------------------------------------
-- Server version	5.5.5-10.1.10-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `post`
--

DROP TABLE IF EXISTS `post`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `post` (
  `postID` int(11) NOT NULL AUTO_INCREMENT,
  `userID` int(11) NOT NULL,
  `place` varchar(50) NOT NULL,
  `lat` double DEFAULT NULL,
  `lng` double DEFAULT NULL,
  `price` varchar(30) DEFAULT NULL,
  `comment` text,
  `star` tinyint(1) NOT NULL DEFAULT '5',
  `postTime` TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`postID`)
) ENGINE=InnoDB AUTO_INCREMENT=95 DEFAULT CHARSET=utf8 COMMENT='動態的表格';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `post`
--

LOCK TABLES `post` WRITE;
/*!40000 ALTER TABLE `post` DISABLE KEYS */;
INSERT INTO `post` VALUES (1,2,'1',NULL,NULL,'230','每次當吃貨就是挺著一個超大的肚子出餐廳門的啊...............不過這次的照片意外的少，因為大多數的時間都是拿著剪刀、鉗子、和刮蟹肉的工具在跟清蒸蟳搏鬥，手都髒兮兮呀XDD\r\n吃蟹果然是件很麻煩的事情...\r\n尤其不能跟剛認識沒多久的人一起吃喔~如果還想保持形象的話 ☆〜（ゝ。∂）（就像吃漢堡也一樣噢）\r\n蟹逅畢竟是個螃蟹專賣，所以來這兒當然是要吃蟹摟~很推薦！特別是香辣蟹真是太好吃了ψ(｀∇´)ψ！！不過老闆在聊天的時候也非常的自豪說他們家的牛肉也是非常高級、價格卻比外面相同等級的餐廳便宜上許多，讓人也躍躍欲試餒~ 以上隨意的交代完畢（喂)',3,'2016-04-11 20:19:08'),(2,1,'EVANSBURGER',25.0230727,121.52810210000007,'100','拿在手裡是燙手的鬆餅體，內餡是晚一點吃就會融化的香草巧克力冰淇淋 好吃極了啦~ 鬆餅體本身烤的酥脆又鬆軟可口，因為天氣很熱，大口咬下冰淇淋鬆餅， 整個人的感覺就像在沙漠裡喝到水一樣這麼平價又好吃的鬆餅， 難怪一堆人都不怕太陽曬也要吃小木屋鬆餅。 台大校園內很多座位都可以坐著吃，也可以自己帶食物來趟野餐之旅~',3,'2016-04-11 16:23:31'),(3,1,'1',NULL,NULL,'0','C',3,'2016-04-14 12:53:10'),(5,1,'1',NULL,NULL,'0','',3,'2016-04-14 15:13:45'),(6,6,'1',NULL,NULL,'0','中文',3,'2016-04-14 16:26:52'),(7,6,'1',NULL,NULL,'0','中文字老師',3,'2016-04-14 16:27:44'),(8,1,'1',NULL,NULL,'0','',3,'2016-04-14 17:05:57'),(9,1,'1',NULL,NULL,'0','qweqwe',3,'2016-04-14 17:06:14'),(10,1,'咖啡弄(敦化店)',25.0425279,121.55148350000002,'0','',5,'2016-04-14 17:56:27'),(11,1,'新光三越台北南西店一館',25.052264,121.52109399999995,'0','',5,'2016-04-15 02:38:42'),(12,1,'小木屋鬆餅',25.0155966,121.53765369999996,'約50到80左右','拿在手裡是燙手的鬆餅體，內餡是晚一點吃就會融化的香草巧克力冰淇淋 好吃極了啦~ 鬆餅體本身烤的酥脆又鬆軟可口，因為天氣很熱，大口咬下冰淇淋鬆餅， 整個人的感覺就像在沙漠裡喝到水一樣這麼平價又好吃的鬆餅， 難怪一堆人都不怕太陽曬也要吃小木屋鬆餅。 台大校園內很多座位都可以坐著吃，也可以自己帶食物來趟野餐之旅~',3,'2016-04-18 00:53:06'),(15,1,'Misyaf',24.746578,46.71626570000001,'1000EUR','敘利亞從法國獨立的第二年，邁斯亞夫記錄了有3808名伊斯瑪儀派穆斯林居住。1965年，敘利亞宣布邁斯亞夫為毛毯紡織中心，絕大多數僱傭者都為女性。1970年，邁斯亞夫的城鎮的大部分仍在城牆之內，然而到了1998年，城鎮區域已經擴展到城牆之外了。',3,'2016-04-18 10:00:06'),(16,3,'大山無價飲食空間',24.9511989,121.57485900000006,'<1000ntd','大山無價小確幸\r\n山霧裊裊好尋遊\r\n無限情懷好享受\r\n價美食優好美食\r\n小品佳餚好悠閒\r\n確實令人好回味\r\n幸福感覺好快樂',3,'2016-04-18 10:31:10'),(17,1,'白教堂',51.5139486,-0.07072840000000724,'5000EUR','屋頂上\r\n風很大\r\n所以就\r\n...........',5,'2016-04-18 15:05:48'),(18,1,'三重先嗇宮',25.0505126,121.47595439999998,'約50到80左右','拿在手裡是燙手的鬆餅體，內餡是晚一點吃就會融化的香草巧克力冰淇淋 好吃極了啦~ 鬆餅體本身烤的酥脆又鬆軟可口，因為天氣很熱，大口咬下冰淇淋鬆餅， 整個人的感覺就像在沙漠裡喝到水一樣這麼平價又好吃的鬆餅， 難怪一堆人都不怕太陽曬也要吃小木屋鬆餅。 台大校園內很多座位都可以坐著吃，也可以自己帶食物來趟野餐之旅~',3,'2016-04-18 15:07:09'),(19,1,'OMAYA 麻藥瘋雞 桃園二店',25.0098238,121.31094439999993,'約300左右','讚！會肥',5,'2016-04-18 15:33:01'),(20,1,'敖溪村',26.078804,119.498243,'約50到80左右','拿在手裡是燙手的鬆餅體，內餡是晚一點吃就會融化的香草巧克力冰淇淋 好吃極了啦~ 鬆餅體本身烤的酥脆又鬆軟可口，因為天氣很熱，大口咬下冰淇淋鬆餅， 整個人的感覺就像在沙漠裡喝到水一樣這麼平價又好吃的鬆餅， 難怪一堆人都不怕太陽曬也要吃小木屋鬆餅。 台大校園內很多座位都可以坐著吃，也可以自己帶食物來趟野餐之旅~',4,'2016-04-18 15:37:21'),(23,2,'OMAYA春川炒雞-三重正義店',25.0651373,121.49718819999998,'500','有韓味',3,'2016-04-18 17:30:02'),(24,2,'Pocha 韓式熱炒포차',25.0404546,121.55350010000006,'500','有韓味',3,'2016-04-18 17:56:25'),(25,2,'娘子韓食-大安店',25.0443627,121.54715140000008,'500','有韓味',5,'2016-04-18 17:58:33'),(26,2,'義饗食堂',25.013404,121.53619700000002,'500',' 有義味',5,'2016-04-18 18:03:36'),(27,2,'洋朵義式廚坊',24.7842823,121.0184911,'500','有義味',3,'2016-04-18 18:05:39'),(28,2,'瑪莎拉義式精緻料理餐廳Marsala',25.0385117,121.55607680000003,'500','有義味',3,'2016-04-18 18:08:00'),(29,2,'FOREST森林義式餐廳',25.0407492,121.5532303,'500','有義味',3,'2016-04-18 18:12:09'),(30,2,'螺絲瑪莉義麵坊',25.051715,121.52191300000004,'500','有義味',3,'2016-04-18 18:14:51'),(31,2,'貳樓餐廳 Second Floor Cafe 微風台北車站店',25.0479465,121.51709579999999,'500','下午味',3,'2016-04-18 18:27:07'),(32,2,'光點紅氣球',25.053279,121.52216099999998,'500','下午味',3,'2016-04-18 18:29:41'),(33,2,'好初早餐',25.0277894,121.46999329999994,'平易近人','上午味',3,'2016-04-18 18:33:49'),(34,2,'Hana Cafe 大安店',25.0425781,121.54689329999997,'500','下午味',3,'2016-04-18 18:38:39'),(35,2,'Rilakkuma Café 拉拉熊咖啡廳',25.040674,121.55417,'500','下午味',3,'2016-04-18 18:39:53'),(36,2,'黑鳥先生 mr. black bird',25.0438875,121.55126610000002,'500','下午味',3,'2016-04-18 18:40:41'),(37,3,'王記府城肉粽',25.04801,121.54606100000001,'500','台灣味',3,'2016-04-18 18:47:05'),(38,3,'兄弟蚵仔麵線',25.0139312,121.53400110000007,'60','台灣味',3,'2016-04-18 18:47:49'),(39,3,'先進海產店',25.0463849,121.55380489999993,'500','很先進!',3,'2016-04-18 18:51:46'),(40,3,'金峰魯肉飯',25.0320529,121.51852429999997,'150','台灣味',3,'2016-04-18 18:56:08'),(41,3,'金子半之助 台北車站',25.0477453,121.51713169999994,'500','日本味',3,'2016-04-18 18:57:17'),(42,3,'阜杭豆漿',25.0441795,121.52468870000007,'100','台灣味',3,'2016-04-18 18:58:34'),(43,3,'阿桐阿寶四神湯',25.0573755,121.51774260000002,'100','台灣味',3,'2016-04-18 18:59:51'),(44,3,'阿財彰化肉圓',25.0477964,121.54137179999998,'50','台灣味',3,'2016-04-18 19:00:50'),(45,3,'富霸王豬腳',25.053247,121.53351190000001,'150','台灣味',3,'2016-04-18 19:02:17'),(46,3,'鄭記豬腳飯',25.0468719,121.51088300000004,'100','台灣味',3,'2016-04-18 19:03:15'),(48,3,'石碇許家手工麵線',24.96436,121.66412100000002,'200','台灣味',3,'2016-04-18 19:05:12'),(49,3,'金沙塔雲泰料理',25.044812,121.5473432,'500','台灣味',3,'2016-04-18 19:08:43'),(50,10,'LACUZ泰式料理吃到飽',25.040678,121.54637000000002,'500','有泰味',3,'2016-04-18 19:10:32'),(51,10,'晶湯匙泰式主題餐廳',25.0493449,121.51682490000007,'500','有泰味',3,'2016-04-18 19:17:40'),(52,10,'小湯匙 越式料理',25.0493449,121.51682490000007,'500','有越味',3,'2016-04-18 19:18:52'),(53,10,'印度皇宮',25.042675,121.563804,'500','有印味',3,'2016-04-18 19:20:53'),(54,10,'磐石坊',25.02806799999999,121.55128100000002,'500','印尼味',3,'2016-04-18 19:22:47'),(55,10,'潮品集(承德京站店)',25.0499699,121.51698729999998,'500','有港味',3,'2016-04-18 19:23:55'),(56,10,'新葡苑',25.0414541,121.54326600000002,'500','有港味',3,'2016-04-18 19:24:51'),(57,10,'糖朝港式飲茶甜品',24.1660072,120.64342169999998,'500','有港味',3,'2016-04-18 19:26:06'),(58,10,'京星港式飲茶Part.2店',25.0412332,121.55050719999997,'500','有港味',3,'2016-04-18 19:27:02'),(59,10,'添好運',25.0459831,121.51707179999994,'500','有港味',3,'2016-04-18 19:27:55'),(60,10,'Mini K 小韓坊',25.0353494,121.56792310000003,'500','台灣味',3,'2016-04-18 19:29:19'),(61,10,'涓豆腐',25.0479239,121.51708099999996,'500','有韓味',5,'2016-04-18 19:30:03'),(63,3,'山上果園',24.7861434,121.67210009999997,'500','風水唷！',3,'2016-04-19 10:32:26'),(64,9,'溪堤 Cafe\'',24.9570789,121.21830750000004,'約100~150元','東西蠻好吃，價位也算便宜，裝潢很有特色。',3,'2016-04-19 11:17:30'),(67,11,'AWESOME BURGER',25.04202399999999,121.56416690000003,'500','有美味',1,'2016-04-20 14:05:00'),(68,11,'Burger & Co',25.0311761,121.55334629999993,'500','有美味',3,'2016-04-20 14:06:21'),(69,11,'EATING TIME',25.0310759,121.52940100000001,'500','有美味',3,'2016-04-20 14:07:14'),(70,11,'Bravo Burger發福廚房',25.0447329,121.5475169,'500','有美味',3,'2016-04-20 14:08:02'),(71,11,'Trio',25.03054869999999,121.55142290000003,'500','有酒味',3,'2016-04-20 14:08:58'),(72,11,'A Train Leads The Way To Jazz',25.046863,121.54063399999995,'500','有酒味',3,'2016-04-20 14:09:57'),(84,3,'鷹流東京醤油拉麺【蘭丸ranmaru】延吉街店',25.0480597,121.55327650000004,'400','不似豚骨湯頭般的濃郁稠厚，顏色稍深，但勉強還算是清徹，以台灣人的飲食習慣來說，它足以稱得上是重口味了，當湯頭徐徐滑入喉間，可以明顯地感受它的甜氣與香味，還略帶了一些微微潤口的油脂，向來愛吃又濃又鹹日系拉麵的我，也忍不住被這碗醬油拉麵給征服。',3,'2016-04-21 11:45:55'),(85,11,'後院',25.0320825,121.55281279999997,'4000','威士忌博物館！',5,'2016-04-25 17:15:17'),(86,11,'Q9 LOUNGE BAR',25.042984,121.55273,'1000','玩樂好去處',4,'2016-04-25 17:17:04'),(87,11,'建國啤酒廠',25.047092,121.536338,'約500','生啤酒好喝',5,'2016-04-25 17:18:06'),(94,1,'CAMPUS CAFE 內湖店',25.081104,121.56622149999998,'約50到80左右','拿在手裡是燙手的鬆餅體，內餡是晚一點吃就會融化的香草巧克力冰淇淋 好吃極了啦~ 鬆餅體本身烤的酥脆又鬆軟可口，因為天氣很熱，大口咬下冰淇淋鬆餅， 整個人的感覺就像在沙漠裡喝到水一樣這麼平價又好吃的鬆餅， 難怪一堆人都不怕太陽曬也要吃小木屋鬆餅。 台大校園內很多座位都可以坐著吃，也可以自己帶食物來趟野餐之旅~',5,'2016-04-29 17:53:04');
/*!40000 ALTER TABLE `post` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-05-02 19:24:16
